const virtual = {
  data: [{
    id: 0,
    title: '测试0',
    content: '测试0的内容',
    hot: {
      time: ['2019-12-09', '2019-12-10', '2019-12-11'],
      web: [1, 2, 3],
      wx: [3, 2, 1],
      weibo: [2, 2, 2]
    },
    media: [1, 2, 3],
    top: {
      name: ['媒体1', '媒体2', '媒体3'],
      count: [1, 2, 3]
    }
  }, {
    id: 1,
    title: '测试1',
    content: '测试1的内容',
    hot: {
      time: ['2019-12-09', '2019-12-10', '2019-12-11'],
      web: [1, 2, 3],
      wx: [3, 2, 1],
      weibo: [2, 2, 2]
    },
    media: [1, 2, 3],
    top: {
      name: ['媒体1', '媒体2', '媒体3'],
      count: [1, 1, 1]
    }
  }, {
    id: 2,
    title: '测试2',
    content: '测试2的内容',
    hot: {
      time: ['2019-12-09', '2019-12-10', '2019-12-11'],
      web: [1, 2, 3],
      wx: [3, 2, 1],
      weibo: [2, 2, 2]
    },
    media: [1, 2, 3],
    top: {
      name: ['媒体1', '媒体2', '媒体3'],
      count: [2, 2, 2]
    }
  }, {
    id: 3,
    title: '测试3',
    content: '测试3的内容',
    hot: {
      time: ['2019-12-09', '2019-12-10', '2019-12-11'],
      web: [1, 2, 3],
      wx: [3, 2, 1],
      weibo: [2, 2, 2]
    },
    media: [1, 2, 3],
    top: {
      name: ['媒体1', '媒体2', '媒体3'],
      count: [3, 3, 3]
    }
  }],
  virtual: true
}
console.log(virtual)
